-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 16:11:15
-- 游戏 AppID: 1295660
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(1295660)
addtoken(1295660,"16771268434109846988")
addappid(1295661,0,"59cf929fe0be7af1bba7498247138b359bcc8141d6921f65f06f5d3c4e604430")
setManifestid(1295661, "7698180167701946160")
addappid(1295662,0,"2d91bb0ac40f79f21d133921c8092cee1bbc5622c1e429d5d5e65a5543a440eb")
setManifestid(1295662, "4062637378790047565")
addappid(1295663,0,"129446ed0c86a3cecf211aca2aca7c0ef0b14248fe2e7229afb79e90f2b07531")
setManifestid(1295663, "7409660199452954544")
addappid(1295665,0,"ad00cf603a7538a190b6f7e523a9f9b1ff48759aacb39f2b35a70c5302fcef37")
setManifestid(1295665, "9003845158150669050")
addappid(1295666,0,"68e1686bc8f5a23173a86f6a5c3fb61ae2714081bf956976f7f837a1f03a9779")
setManifestid(1295666, "4472383718678611911")