-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 13:52:44
-- 游戏 AppID: 2140330
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(2140330)
addappid(2140331,0,"a30af95c1901fa829009611ec953e3f4eb01f70431f9191f423f711f6f22f47d")
setManifestid(2140331, "634888713277826248")
addappid(2140332,0,"11333408b0267ea0a810b02e84fab1f1ba4dbeee58d16106ea53d7dff0e15795")
setManifestid(2140332, "8074448667519660599")
addappid(3340991,0,"023daedb070e5af8704dc88ee0af829f5c11923d2e6a42cca11ba5713b9f4491")
setManifestid(3340991, "2898052249903094762")