-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 14:00:57
-- 游戏 AppID: 2246340
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(2246340)
addappid(2246341,0,"15f418b98b8ade3be07b095f07a9ffc62ab918cf659a2fd7465fcb41c462f0af")
setManifestid(2246341, "4276490724741861191")
addappid(3308900,0,"86e9ff2249c193631e8e04855d9c6154071b06491dced87279c1c72b1662556d")
setManifestid(3308900, "5891069512660502042")