-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 16:40:35
-- 游戏 AppID: 2556990
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(2556990)
addappid(2556991,0,"fcfb5884860aaf7a15a1a823f60814216d3bb2fdcac130608793ae365b774ac6")
setManifestid(2556991, "7024764919198833624")
addappid(1716751,0,"84780b728a23b1dabbe8b064807ccd3dbd40c67139ed569101104a418c581675")
setManifestid(1716751, "1719625392615074191")