-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 18:39:49
-- 游戏 AppID: 2582560
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(2582560)
addappid(2582561,0,"ac359dbd4e38d078bab3b059797599a3c7f41423406c468825b27386afce46c4")
setManifestid(2582561, "8668133634747309684")
addappid(2582562,0,"833e8a4e1f351c4d37259578665fe7384c32bc36569fb9b7febd77aa7772735d")
setManifestid(2582562, "2384740944003743630")
addappid(3340991,0,"023daedb070e5af8704dc88ee0af829f5c11923d2e6a42cca11ba5713b9f4491")
setManifestid(3340991, "2898052249903094762")