-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 14:46:50
-- 游戏 AppID: 2741360
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(2741360)
addappid(2741361,0,"bdf619a0696d63c3f117ca0ee19d9cafd50b5f42396506f674aa947b728c8d57")
setManifestid(2741361, "7060065011170823408")
addappid(1716751,0,"84780b728a23b1dabbe8b064807ccd3dbd40c67139ed569101104a418c581675")
setManifestid(1716751, "1719625392615074191")