-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 14:51:44
-- 游戏 AppID: 2878980
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(2878980)
addappid(2878981,0,"df09d8fa7b88da65f6fdce275ab09b85e5c12731cad10c147745c7501acb1f14")
setManifestid(2878981, "1749668799585948014")
addappid(3107390,0,"a86b0e16a6d6f9946fc2671411ad8653123970931a5e289b242e3b1cf563381f")
setManifestid(3107390, "5851584071712106802")