-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 15:01:36
-- 游戏 AppID: 3059520
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(3059520)
addappid(3059521,0,"69b468d1904c13ad60ff37077c6c6350439f3e70a1df3afcfc075f41325f6b8b")
setManifestid(3059521, "9127470954646405702")
addappid(3059522,0,"136b91fa8f220638f0a95077f481dbcb9c6f8d5a936401ec0222ddc2cc73de68")
setManifestid(3059522, "7252096692503727991")
addappid(3059523,0,"0fefd33650cc16731c9eaa7582b567f5ab2e1dfe22480ba457f704740cb59275")
setManifestid(3059523, "7682588688250372302")
addappid(3059524,0,"0f267a629c6d00a85bbea9fcadd7a8031d68da2504ea8e24821967b15c695e01")
setManifestid(3059524, "819093926359800446")