-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 16:47:54
-- 游戏 AppID: 3357650
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(3357650)
addappid(3859920)
setManifestid(3859920, "4731286747379700304")
addappid(3859930)
setManifestid(3859930, "6714427611547107917")
addappid(3357651,0,"18e75bfb3f8c26b7a59d9e3a7013e74e1c59fe563aa00ee15f54a35b17691766")
setManifestid(3357651, "2417499809052404547")
addappid(3859920,0,"1fb811843160e2a11211f5bba90ece0ef2dac5994c19936e50ff85faf2f80423")
setManifestid(3859920, "4731286747379700304")
addappid(3859930,0,"14001799a6877a14751af43adbd59ca3cc037cf202aa5615e0c70e057090ddce")
setManifestid(3859930, "6714427611547107917")