-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 05:50:08
-- 游戏 AppID: 3489700
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(3489700)
addappid(3489701,0,"2266ca31f6f2666ebe75906201e72f9398694030ff1c8214aacebcf74dc94ee3")
setManifestid(3489701, "2747626496734343426")
addappid(3596180,0,"a55f79607c32a7e24a388464ddc3cfbc91b2dcee6691061bca3fb32d231ccb32")
setManifestid(3596180, "8344797041293440177")
addappid(3596190,0,"1e65f8baa259f487dcdc1d3dce1e198dd23c9f7b77236e4e56fcc9f6b915a449")
setManifestid(3596190, "6588499701851943951")