-- ============================================================
-- 官方网站: https://steamforge.hyper99.top/
-- 联系 QQ: 2476083228
-- 入库时间: 2026-06-04 15:50:39
-- 游戏 AppID: 703080
-- 游戏类型: D加密游戏（保留 setManifestid）
-- ============================================================

addappid(703080)
addappid(703081,0,"bc33ccdea0df8610185dab43ef1f141daecf265e379acb2feb58fde38212796c")
setManifestid(703081, "9166227121018179147")
addappid(1098120,0,"9decae9ea2fe2d9055772fecad34b56835f0464dff8d4159d7457fc3586d2994")
setManifestid(1098120, "10163085496252241")